In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/023.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

         0    1    2                    3                  4
0      NaN  NaN  NaN  Linder (R)  130,561  Burns (D)  53,553
1      NaN  NaN  NaN                70.9%              29.1%
2   County   PR   TP                  NaN                NaN
3   BARROW   18   18                 8781               2696
4  FORSYTH    8    8                 5550                990

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0    1    2      3      4
3    BARROW   18   18   8781   2696
4   FORSYTH    8    8   5550    990
5  GWINNETT  141  141  98136  43567
6    NEWTON    9    9   3061   2428
7    WALTON   21   21  15033   3872

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0      3      4
3    BARROW   8781   2696
4   FORSYTH   5550    990
5  GWINNETT  98136  43567
6    NEWTON   3061   2428
7    WALTON  15033   3872

In [9]:
df.columns = ['county', 'John Linder', 'Allan Burns']

In [10]:
df.tail(5)

     county John Linder Allan Burns
3    BARROW        8781        2696
4   FORSYTH        5550         990
5  GWINNETT       98136       43567
6    NEWTON        3061        2428
7    WALTON       15033        3872

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county    candidate  votes
0    BARROW  John Linder   8781
1   FORSYTH  John Linder   5550
2  GWINNETT  John Linder  98136
3    NEWTON  John Linder   3061
4    WALTON  John Linder  15033

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
county       10 non-null object
candidate    10 non-null object
votes        10 non-null int64
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '7'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'John Linder', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Allan Burns', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate    party
Allan Burns  Democrat       53553
John Linder  Republican    130561
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county               office district       party    candidate  votes
0    BARROW  U.S. Representative        7  Republican  John Linder   8781
1   FORSYTH  U.S. Representative        7  Republican  John Linder   5550
2  GWINNETT  U.S. Representative        7  Republican  John Linder  98136
3    NEWTON  U.S. Representative        7  Republican  John Linder   3061
4    WALTON  U.S. Representative        7  Republican  John Linder  15033

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')